/**/
"Cancel" = "Annuler";
/**/
"Delete" = "Effacer";
/**/
"Open" = "Ouvrir";
/**/
"Edit" = "Modifier";
/**/
"Yes" = "Oui";
/**/
"Finish" = "Terminer";
/**/
"Done" = "Terminé";
/**/
"Save" = "Enregistrer";
/**/
"Undo" = "Annuler";
/**/
"Redo" = "Répéter";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Oui, supprimer";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Appliquer une géométrie";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Effacer la géométrie";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Supprimer un sommet";
/*Geometry Edit Action Name*/
"Insert Part" = "Insérer une pièce";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Insérer un sommet";
/*Geometry Edit Action Name*/
"Move Vertex" = "Autre sommet";
/*Geometry Edit Action Name*/
"Remove Part" = "Supprimer une partie";

/*Collecting attachments*/
"Add" = "Ajouter";
/*Collecting attachments*/
"Take Photo or Video" = "Prendre une photo ou une vidéo";
/*Collecting attachments*/
"Choose From Library" = "Choisir à partir d'une bibliothèque";
/*Collecting attachments*/
"Photo" = "Photo";
/*Collecting attachments*/
"Video" = "Vidéo";
/*Collecting attachments*/
"Save To Photo Library" = "Enregistrer dans l’album photo";
/*Collecting attachments*/
"Download" = "Télécharger";

/*Date attribute*/
"Today" = "Aujourd";

/**/
"Attachments" = "Pièces jointes";
"Attributes" = "Attributs";

/**/
"Open in Safari" = "Ouvrir dans Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Entrez un numéro compris entre %i et %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Saisissez un chiffre entre %@ et %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Trop grand nombre de caractères (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Ce nombre n'est pas compris dans la plage autorisée.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Le type de champ n'est pas pris en charge";

/**/
"%d of %d" = "%d sur %d";

/**/
"Changing Feature Type" = "Changement de type d'entité";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Vous changez le type d'entité, ce qui peut potentiellement écraser les valeurs de certains champs. Le voulez-vous vraiment ?";

/**/
"Deleting Feature" = "Suppression de l'entité";
"Are you sure you want to delete this feature?" = "Voulez-vous vraiment supprimer cette entité ?";

/**/
"Data for pie chart is invalid" = "Les données pour le diagramme à secteurs ne sont pas valides";
"No data to create a pie chart" = "Aucune donnée pour créer un diagramme à secteurs";
"No image to display" = "Aucune image à afficher";

/**/
"Created by %@ seconds ago" = "Créé par %@ il y a quelques secondes";

/**/
"Created by %@ a minute ago" = "Créé par %@ il y a une minute";

/**/
"Edited by %@ seconds ago" = "Modifié par %@  il y a quelques secondes";

/**/
"Edited by %@ a minute ago" = "Modifié par %@ il y a une minute";

/**/
"Created seconds ago" = "Créé il y a quelques secondes";

/**/
"Created a minute ago" = "Créé il y a une minute";

/**/
"Edited seconds ago" = "Modifié il y a quelques secondes";

/**/
"Edited a minute ago" = "Modifié il y a une minute";

/**/
"Created by %@ %d minutes ago" = "Créé par %@ il y a %d minutes";

/**/
"Created by %@ an hour ago" = "Créé par %@ il y a une heure";

/**/
"Created by %@ %d hours ago" = "Créé par %@ il y a %d heures";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Créé par %@ le %@ à %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Créé par %@ le %@ à %@";

/**/
"Edited by %@ %d minutes ago" = "Modifié par %@ il y a %d minutes";

/**/
"Edited by %@ an hour ago" = "Modifié par %@ il y a une heure";

/**/
"Edited by %@ %d hours ago" = "Modifié par %@ il y a %d heures";

/**/
"Edited by %@ on %@ at %@ - day" = "Modifié par %@ le %@ à %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Modifié par %@ le %@ à %@";

/**/
"Created by %@" = "Créé par %@";

/**/
"Edited by %@" = "Modifié par %@";

/**/
"Created %d minutes ago" = "Créé il y a %d minutes";

/**/
"Created an hour ago" = "Créé il y a une heure";

/**/
"Created %d hours ago" = "Créé il y a %d heures";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Créé le %@ à %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Créé le %@ à %@";

/**/
"Edited %d minutes ago" = "Modifié il y a %d minutes";

/**/
"Edited an hour ago" = "Modifié il y a une heure";

/**/
"Edited %d hours ago" = "Modifié il y a %d heures";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Modifié le %@ à %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Modifié le %@ à %@";

/* Used to denote a required field */
"Required" = "Requis";

/* Used for naming layers with no names */
"Layer %d" = "Couche %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Impossible de trouver une adresse pour l'emplacement";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Impossible de trouver un emplacement pour l'adresse";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Impossible de lire l'adresse";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Fichier introuvable";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Impossible de charger le localisateur";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Erreur interne du localisateur";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Le géocodage des intersections n'est pas pris en charge par le localisateur";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Propriétés du localisateur non valides";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Un champ obligatoire est manquant";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Le localisateur n'est pas initialisé";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Format de localisateur non pris en charge";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Transformation de projection non prise en charge";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Référence spatiale non prise en charge";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Géocodage inverse non pris en charge par ce localisateur.";

/* Network analyst errors */
"Cannot open network." = "Impossible d'ouvrir le réseau.";
"Cannot retrieve route task parameters." = "Impossible de récupérer les paramètres de tâche d'itinéraire.";
"Insufficient number of stops." = "Nombre d'arrêts insuffisant.";
"Stop (%@) was not located." = "L'arrêt (%@) n'a pas été localisé.";
"Stop (%@) is located on a non traversable element." = "L'arrêt (%@) est situé sur un élément non traversable.";
"Stop (%@) is located on a soft restricted element." = "L'arrêt (%@) est situé sur un élément peu restreint.";
"Point barrer (%@) was not located." = "L'interruption ponctuelle (%@) n'a pas été localisée.";
"Point barrier (%@) has invalid added cost attribute name." = "L'interruption ponctuelle (%@) possède un nom d'attribut de coût ajouté non valide.";
"Line barrier (%@) has invalid scaled cost attribute name." = "L'interruption linéaire (%@) possède un nom d'attribut de coût proportionné non valide.";
"Line barrier (%@) does not cover any network elements." = "L'interruption linéaire (%@) ne couvre aucun élément de réseau.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "L'interruption polygonale (%@) possède un nom d'attribut de coût proportionné non valide.";
"Polygon barrier (%@) does not cover any network elements." = "L'interruption polygonale (%@) ne couvre aucun élément de réseau.";
"'%@' is an invalid impedance attribute." = "'%@' est un attribut d'impédance non valide.";
"'%@' restriction attribute is invalid." = "Attribut de restriction '%@' non valide.";
"'%@' accumulate attribute is invalid." = "Attribut d'accumulation '%@'  non valide.";
"'%@' is an invalid directions time attribute." = "'%@' est un attribut de temps de directions non valide.";
"Directions distance attribute is invalid." = "L'attribut de distance de directions est non valide.";
"Invalid attribute parameter attribute name (%@)." = "Nom d'attribut du paramètre d'attribut (%@) non valide.";
"Invalid attribute parameter parameter name (%@)." = "Nom de paramètre du paramètre d'attribut (%@) non valide.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Type de valeur non valide pour l'attribut (%1$@) paramètre (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valeur d'utilisation de restriction non valide pour l'attribut (%1$@) paramètre (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valeur d'utilisation de restriction neutre pour l'attribut (%1$@) paramètre (%2$@).";
"Soft restricted element (%@) was traversed." = "L'élément peu restreint (%@) a été traversé.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Le réseau ne possède pas d'attribut de hiérarchie pour effectuer une planification d'itinéraire hiérarchique.";
"No path can be found between a given pair of stops (%@)." = "Impossible de trouver un chemin entre deux d'arrêts (%@) donnés.";
"The input spatial reference is undefined." = "La référence spatiale en entrée n'est pas définie.";
"The output spatial reference is undefined." = "La référence spatiale en sortie n'est pas définie.";
"The directions style is invalid." = "Le style de la feuille de route est non valide.";
"The directions language is invalid." = "La langue de la feuille de route est non valide.";
"Directions time and distance attributes do not match." = "Les attributs de temps et de distance de la feuille de route ne correspondent pas.";
"The directions road class attribute is invalid." = "L'attribut de classe de route de la\n feuille de route est non valide.";
"Unknown condition." = "Condition inconnue.";
"Invalid route task parameters." = "Paramètres de tâche d'itinéraire non valide.";
"Route task's solution cannot be found." = "Solution de la tâche d'itinéraire introuvable.";
"Route task was cancelled." = "La tâche d'itinéraire a été annulée.";
"Route task internal error." = "Erreur interne de tâche d'itinéraire.";
"Route name property is not supported for local route task." = "La propriété de nom de l'itinéraire n'est pas prise en charge pour la tâche d'itinéraire local.";
"Local route task parameters should be retrieved from route task." = "Les paramètre de la tâche d'itinéraire local doivent être extraits de la tâche d'itinéraire.";
"Cannot retrieve network description." = "Impossible d'extraire la description du réseau.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Un seul attribut de longueur peut être spécifié pour impedanceAttributeName et accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Un seul attribut de temps peut être spécifié pour impedanceAttributeName et accumulateAttributeNames..";
"Service not supported." = "Le service n'est pas pris en charge.";
"Specified start time occurs before January 1, 1970." = "La date de début spécifiée est antérieure au 1er janvier 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "La date de début de l'arrêt (%@) est antérieure au 1er janvier 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Le début de la fenêtre horaire locale de l'arrêt (%@) est antérieure au 1er janvier 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Le début de la fenêtre horaire UTC de l'arrêt (%@) est antérieure au 1er janvier 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "L'arrêt (%@) a une fenêtre horaire qui se termine avant qu'elle ne commence.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "pi";
"in" = "po";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Inconnu";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimètres";
"Decimal Degrees" = "Degrés décimaux";
"Decimeters" = "Décimètres";
"Feet" = "Pieds";
"Inches" = "Pouces";
"Kilometers" = "Kilomètres";
"Meters" = "Mètres";
"Miles" = "Milles";
"Millimeters" = "Millimètres";
"Nautical Miles" = "Milles nautiques";
"Points" = "Points";
"Yards" = "Yards";

/* Area Units Abbreviated Strings */
"sq. in" = "pc²";
"sq. ft" = "pd²";
"sq. yd" = "yd²";
"ac" = "ac";
"sq. mi" = "mi²";
"sq. mm" = "mm²";
"sq. cm" = "cm²";
"sq. dm" = "dm²";
"sq. m" = "m²";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "km";

/* Area Units Display Strings */
"Square Inches" = "pc²";
"Square Feet" = "Pieds carrés";
"Square Yards" = "Yards carrés";
"Acres" = "Acres";
"Square Miles" = "Milles carrés";
"Square Millimeters" = "Millimètres carrés";
"Square Centimeters" = "Centimètres carrés";
"Square Decimeters" = "Décimètres carrés";
"Square Meters" = "Mètres carrés";
"Ares" = "Ares";
"Hectares" = "Hectares";
"Square Kilometers" = "Kilomètres carrés";

/* Errors */
"Error" = "Erreur";
"Class not @protocol AGSCoding compliant" = "Classe non compatible avec @protocol AGSCoding";
"Authorization required" = "Autorisation requise";
"Token is invalid or has expired" = "Le jeton est non valide ou a expiré";
"Unknown error occurred" = "Une erreur inconnue s'est produite";
"Empty username/password" = "Nom d'utilisateur/mot de passe vide";
"Token URL is nil. You must set a valid token URL on the credential." = "L'URL a une valeur nil. Vous devez définir une URL de jeton valide dans les informations d'identification.";
"Unknown authentication error" = "Erreur d'authentification inconnue";
"Error extracting identity" = "Erreur d'extraction d'identité";
"Error adding identity to the keychain" = "Erreur d'ajout d'identité à la chaîne de clés";
"Invalid Credentials" = "Informations d'identification non valides";
"Bad URL." = "URL incorrecte.";
"The feature layer does not expose an object-id field." = "La couche d'entités ne présente pas de champ object-id.";
"Both geodatabase and syncParams are required for this method." = "La géodatabase et syncParams sont requis pour cette méthode.";
"Uploading deltas is not supported with this replica." = "Le téléchargement des deltas n'est pas pris en charge avec cette réplique.";
"Error creating delta geodatabase" = "Erreur de création de la géodatabase de deltas";
"Unable to create result image layer" = "Impossible de créer une couche d'image de résultat";
"Cache at path '%@' not found." = "Cache introuvable au chemin d'accès '%@'.";
"To add an item, you must be logged in to the portal." = "Vous devez être connecté au portail pour ajouter un élément.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Pour ajouter un élément, vous devez spécifier une valeur dans AGSPortalItemContentParameters.";
"The portal failed to add the item." = "Echec d'ajout de l'élément dans le portail.";
"To delete an item, you must be logged in to the portal." = "Vous devez être connecté au portail pour supprimer un élément.";
"The portal failed to delete the item." = "Echec de suppression de l'élément dans le portail.";
"To update an item, an itemId and logged in user are required." = "Un itemId et un utilisateur connecté sont requis pour mettre à jour un élément.";
"The item failed to update." = "Echec de mise à jour de l'élément.";
"The item failed to update JSON." = "Echec de mise à jour de JSON par l'élément.";
"You must be logged in to a portal to add a comment." = "Vous devez vous connecter à un portail pour ajouter un commentaire.";
"The comment failed to be added." = "Echec d'ajout du commentaire.";
"You must be logged in to a portal to fetch the current user's rating." = "Vous devez vous connecter à un portail pour récupérer l'évaluation de l'utilisateur actuelle.";
"You must be logged in to a portal to add a rating." = "Vous devez vous connecter à un portail pour ajouter une évaluation.";
"The rating failed to be added." = "Echec d'ajout de l'évaluation.";
"To share an item, you must be logged in to the portal." = "Vous devez être connecté au portail pour partager un élément.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Vous devez être connecté au portail pour annuler le partage d'un élément et pour spécifier les groupes avec lesquels annuler le partage.";
"Bad Request" = "Mauvaise requête";
"Credential Required" = "AGSCredential requis";
"Job not created" = "Tâche non créée";
"Service did not return a valid URL" = "Le service n'a pas renvoyé d'URL valide";
"Service did not return a file" = "Le service n'a pas renvoyé de fichier";
"Service did not return a size" = "Le service n'a pas renvoyé de taille";
"Job failed" = "La tâche a échoué";
"Job timed out" = "La tâche a expiré";
"Job was cancelled" = "La tâche a été annulée";
"Job was deleted" = "La tâche a été supprimée";
"Feature with objectId: %d not found" = "L\\'entité avec objectId : %d est introuvable";
"No object-id values specified for feature table query." = "Aucune valeur object-id spécifiée pour la requête de table d'entités.";

/* OAuth */
"The specified clientID is invalid" = "L'ID de client spécifié n'est pas valide";

/* Sync */
"Upload is not supported with this service." = "Le téléchargement vers le serveur n\\'est pas pris en charge pour ce service.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Pour appeler la synchronisation, une direction de synchronisation autre que AGSGDBSyncDirectionNone doit être spécifiée.";